<template>
	<div class="wrapContent">
		<div class="wrap">
			<p class="before">来，说说你在做什么，想什么……</p>
			<el-input class="textarea" :maxlength="200" type="textarea" :rows="3" placeholder="我想说……" v-model="textarea">
			</el-input>
			<el-button type="danger" size="small" :disabled='textarea?false:true' class="send_talking">发表</el-button>
			<div class="talkList">
				<div class="talkingItem" v-for="item in talkList" :key="item.id">
					<p class="title">{{item.title}}</p>
					<p class="text">{{item.text}}</p>
					<p class="creatTime">{{item.creatTime}}</p>
				</div>
			</div>
		</div>
	</div>



</template>	
<script>
import('./center.scss')

export default {
	name:"center",
	data(){
		return{
			textarea:null,
			talkList:[
				{
					title:null,
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				},
				{
					title:'佛说：柔和者，自然善良',
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				},
				{
					title:null,
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				},
				{
					title:'佛说：柔和者，自然善良',
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				},
				{
					title:null,
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				},
				{
					title:null,
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				},
				{
					title:null,
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				},
				{
					title:null,
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				},
				{
					title:null,
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				},
				{
					title:null,
					text:'人生天地间，若白驹之过客，奔波忙碌都是为了抵达，有沉沉浮浮，也会有海阔天空的美好，恩怨是非，也终是云淡风轻的历练，花开花落轮回间，风景在辗转，总有些留不住的，也总有抵达不了的，淡定豁达才会释然，内心明朗才会踏实快乐。',
					creatTime:'2017-12-30 09:23'
				}
			]
		}
	}
}

</script>